import matplotlib.pyplot as plt
from matplotlib.lines import lineStyles

# Пример данных
# x = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# y = [6, 3, 2.76, 1.5, 1.4, 0.5, 1, 1.25, -0.34, 0.5]
# y2 = [0.6, 0.6, 0.8, 0.6, 0.7, 0.3, 0.7, 1, -0.3, 0.5]

# x = [0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1.0]
# y = [20, 10, 6.67, 5, 2, 1.67, 2.86, -1.25, 1.11, 0]
# y2 = [2, 2, 2, 2, 1, 1, 2, -1, 1, 0]


x = [1000, 2000000, 4*1000000, 6*1000000, 8*1000000, 10*1000000, 12*1000000, 14*1000000, 16*1000000, 18*1000000]

y = [1, 0.93, 0.93, 0.96, 0.95, 0.86, 0.85, 0.86, 0.82, 0.67]

# x = [i/(-0.5) for i in y]
print([1000, 800, 600, 400, 200, 50, 40, 30, 20, 10, 9, 8, 7, 6, 5, 4, 3, 2].reverse())

x2 = [1000, 800, 600, 400, 200, 50, 40, 30, 20, 10, 9, 8, 7, 6, 5, 4, 3, 2]
x2.reverse()
y2 = [1, 1, 1, 1, 1, 1, 1, 1, 1, 0.96, 0.93, 0.93, 0.92, 0.88, 0.83, 0.77, 0.67, 0.43]
y2.reverse()
y22 = [1, 1, 1, 1, 1, 1, 1, 1.01, 1.01, 1.01, 1.02, 1.01, 1.01, 1.02, 1.02, 1.01, 1.01, 1.01]
y22.reverse()
# y = [1, 1, 1, 1, 1, 0.99, 0.99, 0.98, 0.97, 0.96, 0.92, 0.92, 0.9, 0.88, 0.88, 0.86, 0.86]
# U = [5, 5, 5, 5, 5, 4.95, 4.95, 4.9, 4.85, 4.8, 4.6, 4.6, 4.5, 4.4, 4.4, 4.3, 4.3]
# f = [20, 30, 37, 45, 50, 2000, 4000, 6000, 8000, 10000, 11000, 12000, 13000, 14000, 15000, 16000, 17000]
x3 = [1, 2, 3, 4,  5, 6, 7, 8, 9]
y3 = [0.79,  1.99, 3.1,  4.1, 5.1,  6.1, 7.05, 8.16, 9.15]
# Создание графика
# plt.plot(x, y, marker='o', label='Относительная погрешность')
# plt.plot(x, y2, marker='s', label='Приведённая погрешность')

# plt.plot(y, x, marker='o')
plt.plot(x, y, marker='s')
# plt.plot(x2, y2, marker='o', label='Закрытый вход')
# plt.plot(x2, y22, marker='s', label='Открытый вход')
import numpy as np
plt.xscale('log')
# plt.xticks(np.arange(min(x), max(x), 100))
# plt.plot(y3, x3, marker='p', linestyle="dashed", label='Линейная характеристика')

# Добавление заголовка и подписей осей
# plt.title('График зависимости погрешностей от показаний прибора')
plt.ylabel('K(f)')
plt.xlabel('f, Гц')
# plt.legend()
# Отображение сетки
plt.grid(True)

# Показ графика
plt.show()
